Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.SetMaxRangeToUnlimited
Sets the max range on the value to unlimited
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.MaxRange
The maximum range for this demand factor value.  For example, objects 1 to 3 can have 100% demand factor.
In the example above, the maximum range will be 3.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.MinRange
The minimum range for this demand factor value.  For example, objects 1 to 3 can have 100% demand factor.
In the example above, the minimum range will be 1.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.Factor
The demand factor for this demand factor value.  For example, objects 1 to 3 can have 100% demand factor.
In the example above, the demand factor will be 1.0.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.#ctor(System.Double,System.Double,System.Double)
Constructor.  Initializes factor, minimum range and maximum range to values passed in.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.#ctor
Default constructor.  Initializes factor to 1.0 or 100%.  Min and max range are set to 0.0
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue
This class represents values used by a particular demand factor definition.  Each instance
corresponds to a row in a table of values.  These values are part of the ElectricalDemandFactorDefinition
class.
Since:
2011